tonywestonuk/magitrac/magitrac_server_s3/esp32s3_dsp.cpp
/********************************************************************
 * @brief esp32s3.cpp source file
 * 
 * @note FFT functions using the ESP32-S3 DSP library. 
 * o FFT Magnitude Functions
 * o IIR Low Pass Filter
 * o IIR High Pass Filter
 * o IIR Bandpass Filter
 * o IIR Notch Filter
 * 
 * j. Hoeppner @ 2026
 */
#include "esp32s3_dsp.h"

// ##################################################################
//                      FFT CLASS FUNCTIONS 
// ##################################################################

ESP32S3_FFT::ESP32S3_FFT(void)   // constructor
{
   hann_window = nullptr;
   fft_buffer = nullptr;
   fft_output = nullptr;
}

ESP32S3_FFT::~ESP32S3_FFT(void) { end(); } // destructor


/********************************************************************
 * @brief init() Initialize the FFT engine with specified params. Call
 *    this once before any number of calls to compute(). If end() is
 *    called, init() must be called again before any calls to compute().
 * 
 * @param fft_size - Num of discrete FFT points (example 1024). @note : fft_size
 * should be power of 2 - i.e. 128 / 256 / 512 / 1024 etc.
 * @param fft_samples - normaly the same as 'fft_size'. If larger, a sliding
 *       fft will be implemented with a 50% overlap. @note : fft_samples should
 *       be an even multiple of 'fft_size'.
 * @param spectral_select - see esp32s3_fft.h for details about sliding windows.
 * @return Pointer to a fft_table_t structure. If no memory available, returns NULL.
 */
fft_table_t * ESP32S3_FFT::init(uint32_t fft_size, uint32_t fft_samples, uint8_t spectral_select)
{
   uint16_t i;
   static fft_table_t fft_table;
   _spectral_select = spectral_select;
   _fft_size = fft_size;                  // must be a power of 2: 64, 128, 256, 512, etc.
   _original_samples = fft_samples;     // num of samples to be fft'd

   // Calculate 'hop' size
   if(_spectral_select == SPECTRAL_NO_SLIDING)
      _hop_size = _fft_size;          
   else
      _hop_size = _fft_size / 2;

   // Round total samples to be evenly divisible by fft_size.
   // This guarantees all samples are processed.
   uint16_t tmod = _original_samples % _fft_size;   
   if(tmod == 0)           // already evenly divisible by _fft_size
      _total_samples = _original_samples;
   else 
      _total_samples = _original_samples + (_fft_size - tmod); // 50% sliding window

   // Calculate number of sliding frames
   if(_spectral_select == SPECTRAL_NO_SLIDING)
      _num_sliding_frames = _total_samples / _hop_size;
   else 
      _num_sliding_frames = 1 + ((_original_samples - _fft_size) / _hop_size);       

   if(_num_sliding_frames < 0) _num_sliding_frames = 0;  // avoid crash

   // allocate memory in PSRAM for internal buffers.
   // free memory if previously allocated
   if(hann_window)
      free(hann_window);
   hann_window = (float *) heap_caps_malloc(_fft_size * sizeof(float), MALLOC_CAP_SPIRAM | MALLOC_CAP_32BIT); // discrete hann window
   
   // fft buffer - internal working buffer. Aligned to 32 byte blocks.
   if(fft_buffer)
      free(fft_buffer);
   fft_buffer = (float *) heap_caps_aligned_alloc(32, ((_fft_size * 2) * sizeof(float)) + 64, MALLOC_CAP_SPIRAM);
   
   // fft output buffer - intermediate buffer used for averaging. Aligned to 32 byte blocks.
   if(fft_output)
      free(fft_output);
   fft_output = (float *) heap_caps_aligned_alloc(32, _fft_size * sizeof(float), MALLOC_CAP_SPIRAM);

   if (!hann_window || !fft_buffer || !fft_output) {  // check if memory allocated OK
      return NULL;
   } 
   
   // init the ESP32-S3 DSP engine
   dsps_fft2r_init_fc32(NULL, _fft_size);

   // Create hann window 
   for (int i = 0; i < _fft_size; i++) {
      hann_window[i] = 0.5 * (1.0 - cos(2.0 * PI * i / (_fft_size - 1)));
   }     
   fft_table.num_original_samples = _original_samples;
   fft_table.hop_size = _hop_size;
   fft_table.num_sliding_frames = _num_sliding_frames;
   fft_table.size_input_bufr = _total_samples;
   return &fft_table;
}


/********************************************************************
 * @brief Compute FFT from source_data and return result in output_data.
 * @param source_data - ptr to callers time domain data.
 * @param output_data - ptr to callers freq domain data.
 * @param use_hann_window - true: create and employ Hann Window 
 */
void ESP32S3_FFT::compute(float *source_data, float *output_data, bool use_hann_window)
{
   uint16_t frame, start, i, j;

   // zero the result buffer
   for(i=0; i<_fft_size; i++)
      fft_output[i] = 0.0;

   // --- Sliding FFT Loop ---         
   for (frame = 0; frame < _num_sliding_frames; frame++) {
      start = frame * _hop_size;

      // Multiply input * Hann window directly & save into fft_buffer's real parts (even nums)
      if(use_hann_window) {
         dsps_mul_f32(&source_data[start], hann_window, fft_buffer, _fft_size, 1, 1, 2); 
      }

      // Clear imaginary parts (odd indices) for FFT calc
      for (i = 0; i < _fft_size; i++) {
         if(!use_hann_window)
            fft_buffer[2 * i] = source_data[start + i];  // keep real data
         fft_buffer[2 * i + 1] = 0.0f;    // zero out imaginary data
      }     

      // compute FFT
      dsps_fft2r_fc32(fft_buffer, _fft_size);
      dsps_bit_rev_fc32(fft_buffer, _fft_size);    

      // compute magnitudes
      for (j = 0; j < _fft_size; j++) {
         float real = fft_buffer[2 * j];
         float imag = fft_buffer[2 * j + 1];
         float mag = sqrtf(real * real + imag * imag);  // sqrt ((real sqr) + (imag sqr))
         if(_spectral_select == SPECTRAL_AVERAGE) {     // output one averaged _hop_size
            fft_output[j] += mag;
         }
         else if(_spectral_select == SPECTRAL_NO_SLIDING || _spectral_select == SPECTRAL_SLIDING) {   // no frame averaging, output all sequential frames
            output_data[(frame * _fft_size) + j] = mag;          
         }
      }
   }   

   // transfer averaged FFT to 'output_data'
   if(output_data && _spectral_select == SPECTRAL_AVERAGE) {
      for(i=0; i < _fft_size; i++) {
         output_data[i] = fft_output[i] / float(_num_sliding_frames);
      }
   }
}


/********************************************************************
 * @brief Free internal FFT buffer memory. init() must be called before 
 * any more calls to compute().
 * @note If this library was instanciated using 'new', calling 'delete'
 * will automatically call end().
 */
void ESP32S3_FFT::end(void) 
{
   // free memory in PSRAM used for internal buffers
   if(hann_window) {
      free(hann_window);
      hann_window = nullptr;
   }

   if(fft_buffer) {
      free(fft_buffer);
      fft_buffer = nullptr;
   }

   if(fft_output) {
      free(fft_output);
      fft_output = nullptr;
   }
}


/********************************************************************
 * @brief FFT helper, calculate frequency resolution for FFT output bins.
 * @return float frequency bin value. Example:
 *    16000 / 1024 == 15.625 hz. Bin 10 would be 156.25 hz.
 */
float ESP32S3_FFT::calcFreqBin(float sample_rate_hz, float fft_size)  // return freq / output data point
{
   return (sample_rate_hz / fft_size);
}


// ##################################################################
//                LOW PASS FILTER CLASS FUNCTIONS 
// ##################################################################

ESP32S3_LP_FILTER::ESP32S3_LP_FILTER(void) { } // empty constructor

ESP32S3_LP_FILTER::~ESP32S3_LP_FILTER(void) { } // destructor


/********************************************************************
 * @brief Initialize the low pass filter. Call this once on first time 
 * use or when the filter parameters have changed.
 * @param cutoff_freq - Freq where filter has attenuated the data down
 * to -3db. Note that using a higher Q factor will cause the -3db freq
 * to move to a higher frequency.
 * @param sample_rate - Audio sample rate - default 16KHz
 * @param Qfactor - 0.5 (default) <smoother cutoff rate>, 1.0 <sharper cutoff rate>
 */
void ESP32S3_LP_FILTER::init(float cutoff_freq, float sample_rate, float Qfactor)
{
   dsps_biquad_gen_lpf_f32((float *)&coeffs, cutoff_freq / sample_rate, Qfactor); // nominal cutoff rate
}


/********************************************************************
 * @brief Apply LP filter to the data.
 * @param input - ptr to the input float data.
 * @param output - ptr to the output float data.
 * @param len - number of float samples to process.
 */
void ESP32S3_LP_FILTER::apply(float *input, float *output, uint32_t len) 
{
   dsps_biquad_f32_aes3(input, output, len, coeffs, delay_line);
}


// ##################################################################
//                HIGH PASS FILTER CLASS FUNCTIONS 
// ##################################################################

ESP32S3_HP_FILTER::ESP32S3_HP_FILTER(void) { } // empty constructor

ESP32S3_HP_FILTER::~ESP32S3_HP_FILTER(void) { } // destructor


/********************************************************************
 * @brief Initialize the high pass filter. Call this once on first time 
 * use or when the filter parameters have changed.
 * @param cutoff_freq - Freq where filter has attenuated the data down
 * to -3db. Note that using a higher Q factor will cause the -3db freq
 * to move to a higher frequency.
 * @param sample_rate - Audio sample rate - default 16KHz
 * @param Qfactor - 0.5 (default) <smoother cutoff rate>, 1.0 <sharper cutoff rate>
 */
void ESP32S3_HP_FILTER::init(float cutoff_freq, float sample_rate, float Qfactor)
{
   dsps_biquad_gen_hpf_f32((float *)&coeffs, cutoff_freq / sample_rate, Qfactor); // nominal cutoff rate
}


/********************************************************************
 * @brief Apply HP filter to the data.
 * @param input - ptr to the input float data.
 * @param output - ptr to the output float data.
 * @param len - number of float samples to process.
 */
void ESP32S3_HP_FILTER::apply(float *input, float *output, uint32_t len) 
{
   dsps_biquad_f32_aes3(input, output, len, coeffs, delay_line);
}


// ##################################################################
//                BAND PASS FILTER CLASS FUNCTIONS 
// ##################################################################

ESP32S3_BP_FILTER::ESP32S3_BP_FILTER(void) { } // empty constructor

ESP32S3_BP_FILTER::~ESP32S3_BP_FILTER(void) { } // destructor


/********************************************************************
 * @brief Initialize the Bandpass filter. Call this once on first time 
 * use or when the filter parameters have changed.
 * @param center_freq - The frequency of maximum passband gain
 * @param sample_rate - Audio sample rate - default 16KHz
 * @param Qfactor - 0.5 (default) <smoother cutoff rate>, 1.0 <sharper cutoff rate>
 */
void ESP32S3_BP_FILTER::init(float center_freq, float sample_rate, float Qfactor)
{
   dsps_biquad_gen_bpf_f32((float *)&coeffs, center_freq / sample_rate, Qfactor); // nominal cutoff rate
}


/********************************************************************
 * @brief Apply Bandpass filter to the data.
 * @param input - ptr to the input float data.
 * @param output - ptr to the output float data.
 * @param len - number of float samples to process.
 */
void ESP32S3_BP_FILTER::apply(float *input, float *output, uint32_t len) 
{
   dsps_biquad_f32_aes3(input, output, len, coeffs, delay_line);
}


// ##################################################################
//                   NOTCH FILTER CLASS FUNCTIONS 
// ##################################################################

ESP32S3_NOTCH_FILTER::ESP32S3_NOTCH_FILTER(void) { } // empty constructor

ESP32S3_NOTCH_FILTER::~ESP32S3_NOTCH_FILTER(void) { } // destructor


/********************************************************************
 * @brief Initialize the Notch filter. Call this once on first time 
 * use or when the filter parameters have changed.
 * @param notch_freq - Freq of peak attenuated. Default = 3 KHz.
 * @param sample_rate - Audio sample rate - default 16KHz
 * @param notch_gain - gain in the notch band in DB, default -20dB
 * @param Qfactor - 0.5 (default) <smoother cutoff rate>, 1.0 <sharper cutoff rate>
 */
void ESP32S3_NOTCH_FILTER::init(float notch_freq, float sample_rate, float notch_gain, float Qfactor)
{
   dsps_biquad_gen_notch_f32((float *)&coeffs, notch_freq / sample_rate, notch_gain, Qfactor); // nominal cutoff rate
}


/********************************************************************
 * @brief Apply Notch filter to the data.
 * @param input - ptr to the input float data.
 * @param output - ptr to the output float data.
 * @param len - number of float samples to process.
 */
void ESP32S3_NOTCH_FILTER::apply(float *input, float *output, uint32_t len) 
{
   dsps_biquad_f32_aes3(input, output, len, coeffs, delay_line);
}


// ##################################################################
//               BELL (Peaking) FILTER CLASS FUNCTIONS 
// ##################################################################

ESP32S3_BELL_FILTER::ESP32S3_BELL_FILTER(void) { } // empty constructor

ESP32S3_BELL_FILTER::~ESP32S3_BELL_FILTER(void) { } // destructor


/********************************************************************
 * @brief Initialize the Bell (peaking EQ) filter. Call this once on 
 * first time use or when the filter parameters have changed.
 * 
 * @param center_freq - Freq of peak gain. Default = 3 KHz.
 * @param sample_rate - Audio sample rate - default 16KHz
 * @param gain_db - peak gain in DB, default 6dB
 * @param Qfactor - 0.5 (default) <smoother cutoff rate>, 1.0 <sharper cutoff rate>
 */
void ESP32S3_BELL_FILTER::init(float center_freq, float sample_rate, float gain_db, float Qfactor)
{
   // To implement gain in the peaking filter, coordinates are manually generated 
   const float w0 = 2.0f * (float)M_PI * (center_freq / sample_rate);
   const float cw = cosf(w0);
   const float sw = sinf(w0);

   // RBJ peaking EQ uses A = 10^(dBgain/40)
   const float A  = powf(10.0f, gain_db / 40.0f);
   const float alpha = sw / (2.0f * Qfactor);

   float b0 = 1.0f + alpha * A;
   float b1 = -2.0f * cw;
   float b2 = 1.0f - alpha * A;
   float a0 = 1.0f + alpha / A;
   float a1 = -2.0f * cw;
   float a2 = 1.0f - alpha / A;

   // Normalize so a0 = 1
   b0 /= a0; b1 /= a0; b2 /= a0;
   a1 /= a0; a2 /= a0;

   coeffs[0] = b0; coeffs[1] = b1; coeffs[2] = b2; coeffs[3] = a1; coeffs[4] = a2;

}


/********************************************************************
 * @brief Apply Bell (peaking EQ) filter to the data.
 * @param input - ptr to the input float data.
 * @param output - ptr to the output float data.
 * @param len - number of float samples to process.
 */
void ESP32S3_BELL_FILTER::apply(float *input, float *output, uint32_t len) 
{
   dsps_biquad_f32_aes3(input, output, len, coeffs, delay_line);
}


// ##################################################################
//                LOW SHELF FILTER CLASS FUNCTIONS 
// ##################################################################

ESP32S3_LOW_SHELF_FILTER::ESP32S3_LOW_SHELF_FILTER(void) { } // empty constructor

ESP32S3_LOW_SHELF_FILTER::~ESP32S3_LOW_SHELF_FILTER(void) { } // destructor

/********************************************************************
 * @brief Initialize the low shelf filter. Call this once on first time 
 * use or when the filter parameters have changed.
 * @param corner_freq - Freq of peak attenuated. Default = 3 KHz.
 * @param sample_rate - Audio sample rate - default 16KHz
 * @param notch_gain - gain in the notch band in DB, default -20dB
 * @param Qfactor - 0.5 (default) <smoother cutoff rate>, 1.0 <sharper cutoff rate>
 */
void ESP32S3_LOW_SHELF_FILTER::init(float corner_freq, float sample_rate, float gain_db, float Qfactor)
{
   dsps_biquad_gen_lowShelf_f32((float *)&coeffs, corner_freq / sample_rate, gain_db, Qfactor); // nominal cutoff rate
}


/********************************************************************
 * @brief Apply low shelf filter to the data.
 * @param input - ptr to the input float data.
 * @param output - ptr to the output float data.
 * @param len - number of float samples to process.
 */
void ESP32S3_LOW_SHELF_FILTER::apply(float *input, float *output, uint32_t len) 
{
   dsps_biquad_f32_aes3(input, output, len, coeffs, delay_line);
}


// ##################################################################
//                HIGH SHELF FILTER CLASS FUNCTIONS 
// ##################################################################

ESP32S3_HIGH_SHELF_FILTER::ESP32S3_HIGH_SHELF_FILTER(void) { } // empty constructor

ESP32S3_HIGH_SHELF_FILTER::~ESP32S3_HIGH_SHELF_FILTER(void) { } // destructor

/********************************************************************
 * @brief Initialize the low shelf filter. Call this once on first time 
 * use or when the filter parameters have changed.
 * @param corner_freq - Freq of peak attenuated. Default = 3 KHz.
 * @param sample_rate - Audio sample rate - default 16KHz
 * @param notch_gain - gain in the notch band in DB, default -20dB
 * @param Qfactor - 0.5 (default) <smoother cutoff rate>, 1.0 <sharper cutoff rate>
 */
void ESP32S3_HIGH_SHELF_FILTER::init(float corner_freq, float sample_rate, float gain_db, float Qfactor)
{
   dsps_biquad_gen_highShelf_f32((float *)&coeffs, corner_freq / sample_rate, gain_db, Qfactor); // nominal cutoff rate
}


/********************************************************************
 * @brief Apply low shelf filter to the data.
 * @param input - ptr to the input float data.
 * @param output - ptr to the output float data.
 * @param len - number of float samples to process.
 */
void ESP32S3_HIGH_SHELF_FILTER::apply(float *input, float *output, uint32_t len) 
{
   dsps_biquad_f32_aes3(input, output, len, coeffs, delay_line);
}
